blog/resources.protoverse.project.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-04-24 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Relevant Books, Papers and Articles</title>
<meta name="author" content="Dan Dee" />
<meta name="description" content="Creating a synthetic universe from scratch" />
<meta name="keywords" content="books, literature, metaphysics, process philosophy, alife, artificial universe, universal darwinism, natural selection, emergence, complex systems, chaos theory" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="Content-Security-Policy" content="default-src 'self'; script-src 'self' https://wa.skred.net/; connect-src https://wa.skred.net/; style-src 'self' https://*; font-src 'self' https://*; img-src 'self' https://*; media-src 'self' https://*;">
<link rel="stylesheet" href="/static/normalize.css" type="text/css">
<link rel="stylesheet" href="/static/org.css" type="text/css">
<link rel="stylesheet" href="/static/style.css" type="text/css">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Cormorant:wght@300&family=Gentium+Plus:ital,wght@0,400;0,700;1,400;1,700&family=PT+Sans+Caption:wght@400;700&family=PT+Sans+Narrow:wght@400;700&family=PT+Sans:ital,wght@0,400;0,700;1,400;1,700&display=swap" rel="stylesheet">
<link rel="stylesheet" href="/static/fonts/iosevka/fonts.css" type="text/css">
<link rel="icon" type="image/svg+xml" href="/static/monkeyjunglejuice.svg">
<link rel="apple-touch-icon" href="/static/monkeyjunglejuice-icon180.png">
<link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/resources.protoverse.project.html">
</head>
<body>
<div id="preamble" class="status">
<nav id="nav-primary"><a id="site-name" href="/index.html">MonkeyJungleJuice</a> <a id="index" href="/index.html">Index</a><a id="bio" href="/bio.html">Bio</a><a id="github" href="https://github.com/monkeyjunglejuice">Github</a></nav>
<div class="info"><time itemprop="dateModified" datetime="2025-04-20">Last updated: 2025-04-20</time></div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Relevant Books, Papers and Articles</h1>
<p class="subtitle" role="doc-subtitle">Protoverse: Resources</p>
</header><nav class="pager" id="orgb3547c7">
<p>
This is part of the Protoverse project:<br>
</p>
<ul class="org-ul">
<li><a href="introduction.protoverse.project.html">Introduction</a><br></li>
<li><a href="metaphysics.protoverse.project.html">Metaphysics</a><br></li>
<li><a href="engineering.protoverse.project.html">Technical Considerations</a><br></li>
<li><b><a href="resources.protoverse.project.html">Resources</a></b><br></li>
<li><a href="model.protoverse.project.html">Computational Model</a><br></li>
<li><a href="ethics.protoverse.project.html">Ethical Guidelines</a><br></li>
</ul>
</nav>

<div class="message" id="org7fa86de">
<p>
This list is currently in the making and not exhaustive.<br>
</p>

</div>

<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1971fc7">Philosophy / Metaphysics</a></li>
<li><a href="#org4434687">Computer Science / Modeling</a></li>
<li><a href="#org0fdc186">Co-Evolution</a></li>
<li><a href="#org898ac6f">Theoretical/Quantum Physics</a></li>
<li><a href="#org4c84540">Complex Adaptive Systems</a></li>
<li><a href="#orga9bce2e">Textbooks</a></li>
</ul>
</div>
</nav>
<div id="outline-container-org1971fc7" class="outline-2">
<h2 id="org1971fc7"><a href="#org1971fc7">Philosophy / Metaphysics</a></h2>
<div class="outline-text-2" id="text-org1971fc7">
<div class="index" id="org286158e">
<ul class="org-ul">
<li>Darwin&rsquo;s Dangerous Idea (Daniel Dennet): I agree with Dennett&rsquo;s view on the algorithmic nature of evolutionary processes. The significance of Darwin&rsquo;s discovery, which he pictures as &ldquo;Universal Acid,&rdquo; occurred to me long ago and eventually led me to Universal Darwinism. While Dennett explores evolutionary processes on biological and cultural scales, my primary interest lies in the spectrum from the quantum scale to the transition to life.<br></li>

<li>Process and Reality (Alfred North Whitehead): This metaphysical system reads almost like a specification, so that I considered to model Actual Occasions in OCaml. I&rsquo;ve got some objections though, so that I&rsquo;m certain that I wouldn&rsquo;t adopt this system directly, but rather use it as a repository to reconcile my ideas.<br></li>

<li>A Key to Whitehead&rsquo;s Process and Reality (Donald W. Sherburne): An attempt to present the content of &ldquo;Process and Reality&rdquo; in a linear fashion &#x2013; but for me, the elimination of redundancy and repetition prevents the contextual comprehension and understanding the &ldquo;whys&rdquo; of various aspects, hence I actually prefer the web-like and chaotic structure of the original.<br></li>

<li>Whitehead Word Book (John B. Cobb jr.): Really nice glossary, great for a quick read in between.<br></li>

<li>Quantum Mechanics And The Philosophy Of Alfred North Whitehead (Michael Epperson): I think I should consider reading this later.<br></li>

<li>Difference and Repetition (Gilles Deleuze): I&rsquo;ve been thinking deeply about what&rsquo;s behind various phenomena, and it boils down to change, difference, equality and identity. Successive research brought up this book and I&rsquo;m thrilled that I found a kindred spirit who shares my conclusions and actually wrote a whole book about that. Unfortunately I find it incredibly verbose, largely unintellible and I really need to fight through it (I&rsquo;ve got the English translation, since I don&rsquo;t understand French).<br></li>

<li>Germinal Life (Keith Ansell Pearson): &ldquo;[To] illumnate the character of Deleuze&rsquo;s philosophy [&#x2026;] in the context of bio-philosophy&rdquo;; maybe as an intro or follow-up read.<br></li>

<li>Gödel, Escher, Bach (Douglas R. Hofstadter): Poetic contemplation of formal systems, strange loops and recursion. Even though I&rsquo;m fond of Escher&rsquo;s artworks, counting Gödel&rsquo;s incompleteness theorems as one of my &ldquo;roman empires&rdquo; and are somehow intriqued by Bach&rsquo;s compositions, I lack the musical education to appreciate it, and I don&rsquo;t enjoy the dialogues at all. Not a quick read to breeze through either.<br></li>

<li>I Am A Strange Loop (Douglas R. Hofstader): Views on the self-referential structure of consciousness. Not started yet; maybe read later or instead of GEB.<br></li>
</ul>

</div>
</div>
</div>
<div id="outline-container-org4434687" class="outline-2">
<h2 id="org4434687"><a href="#org4434687">Computer Science / Modeling</a></h2>
<div class="outline-text-2" id="text-org4434687">
<div class="index" id="orgb06e359">
<ul class="org-ul">
<li><a href="https://worldscientific.com/worldscibooks/10.1142/8306#t=aboutBook">A Computable Universe: Understanding and Exploring Nature as Computation</a> (Various authors, edited by Hector Zenil): Currently reading.<br></li>

<li><a href="https://people.idsia.ch/~juergen/computeruniverse.html">Computable Universes &amp; Algorithmic Theory of Everything</a> (<a href="https://en.wikipedia.org/wiki/J%C3%BCrgen_Schmidhuber">Jürgen Schmidhuber</a>)<br>
<ul class="org-ul">
<li>Chapter 20 of &ldquo;A Computable Universe&rdquo; (<a href="https://people.idsia.ch/~juergen/fastestuniverse.pdf">preprint PDF</a>)<br></li>
<li><a href="https://people.idsia.ch/~juergen/toes.pdf">Algorithmic Theories of Everything</a> (PDF)<br></li>
<li><a href="https://sferics.idsia.ch/pub/juergen/everything.pdf">A Computer Scientist&rsquo;s View of Life, the Universe and Everything</a> (PDF)<br></li>
</ul></li>

<li><a href="https://sferics.idsia.ch/pub/juergen/zuserechnenderraum.pdf">Calculating Space</a> (Konrad Zuse): The Classic on automata theory and the computational universe.<br></li>

<li><a href="https://www.amazon.com/Communicating-Mobile-Systems-Robin-Milner/dp/0521658691">Communicating and Mobile Systems: The π-Calculus</a> (Robin Milner): π-Calculus is basically a process algebra that might be inspiring for modeling the Protoverse Process dynamics (practical alternatives: Join Calculus and Actor Model).<br></li>

<li><a href="https://groups.seas.harvard.edu/courses/cs252/2016fa/13.pdf">The Chemical Abstract Machines (CHAM): Solutions to Model Concurrency</a> (Lily Tsai): Join-Calculus goes beyond π-Calculus, depicting computations as &ldquo;reactions&rdquo;, which aligns in principle with how I think about interacting Protoverse Processes of various orders. Curiosity: the &ldquo;brownian motion&rdquo; (mixing in order to provoke reactions).<br></li>

<li><a href="https://web.math.princeton.edu/~weinan/papers/weinan_book.pdf">Principles of Multiscale Modeling</a> (Weinan E): Text on multiscale modeling.<br></li>

<li><a href="http://dx.doi.org/10.1590/0100-6045.2019.V42N3.BW">Computer Simulations In Metaphysics: Possibilities And Limitations</a> (Billy Wheeler): Basically advocating for metaphysicians to make use computational models (can&rsquo;t agree more); a glance over several modeling techniques, e.g. agent-based modeling; comes with an example too.<br></li>

<li>A new Kind of Science (Stephen Wolfram): This illustrative book was a major inspiration that encouraged me to eventually take action and build something.<br></li>
</ul>

</div>
</div>
</div>
<div id="outline-container-org0fdc186" class="outline-2">
<h2 id="org0fdc186"><a href="#org0fdc186">Co-Evolution</a></h2>
<div class="outline-text-2" id="text-org0fdc186">
<div class="index" id="org8aec2f4">
<ul class="org-ul">
<li><a href="https://ieeexplore.ieee.org/document/8454482">A Survey on Cooperative Co-Evolutionary Algorithms</a><br></li>

<li><a href="https://link.springer.com/referenceworkentry/10.1007/978-3-540-92910-9_31">Coevolutionary Principles</a> (Handbook of Natural Computing)<br></li>
</ul>

</div>
</div>
</div>
<div id="outline-container-org898ac6f" class="outline-2">
<h2 id="org898ac6f"><a href="#org898ac6f">Theoretical/Quantum Physics</a></h2>
<div class="outline-text-2" id="text-org898ac6f">
<div class="index" id="org197e266">
<ul class="org-ul">
<li>Reality Is Not What It Seems (Carlo Rovelli): I&rsquo;ve got interested in Relational Quantum Mechanics (one of various interpretations) and Loop Quantum Gravity, because both correspond to the process-relational worldview and the Protoverse framework. I&rsquo;ve read it to develop a bit of an intuition for both theories.<br></li>

<li>The Order of Time (Carlo Rovelli): Enertaining book about how various overlapping concepts of time are at play simultaneously, from entropy to perceptional.<br></li>

<li><a href="https://heyredhat.github.io/refs/wheeler_law_without_law.pdf">Law Without Law</a> (John Archibald Wheeler): A case for a participatory universe and emergent dynamic laws instead of pre-determined laws of physics &#x2013; one that supports my cornerstone assumptions for the Protoverse model of dynamically evolving rules. The essay is part of &ldquo;Quantum Theory And Measurement&rdquo;.<br></li>

<li>Our Mathematical Universe (Max Tegmark): Totally agree on his views on infinity (that&rsquo;s how I found out about Tegmark in the first place), and also find the idea of a pluralistic, nested hierarchy of increasing diversity and different rules interesting. His hypothesis is commonly considered radical Platonist (on a first glance), but I think that&rsquo;s not neccessarily the case. It&rsquo;ve read the book a couple of years ago, probably I should read it again, and the papers as well.<br></li>
</ul>

</div>
</div>
</div>
<div id="outline-container-org4c84540" class="outline-2">
<h2 id="org4c84540"><a href="#org4c84540">Complex Adaptive Systems</a></h2>
<div class="outline-text-2" id="text-org4c84540">
<ul class="org-ul">
<li>Chaos (James Gleick): Strangely attracting, enertaining pop-sci introduction to Chaos Theory.<br></li>
</ul>

<div class="index" id="orgbc7d5b1">
<ul class="org-ul">
<li><a href="https://repository.ubn.ru.nl/bitstream/handle/2066/82605/82605.pdf?sequence=1">The Operator Hierarchy</a> (Gerard Jagers op Akkerhuis): I found that one because it seems to be quite similar to &ldquo;Nested Scales Of Complexity&rdquo;, the idea of an abstract multi-scale framework that I&rsquo;m exploring, in order to illustrate the integration of process-relational dynamics with Universal Darwinism. Further research on Jagers op Akkerhuis&rsquo; work shows that his interest and views correspond with mine, which is exciting. <a href="https://theoperatortheory.info">Binge-worthy website</a>, and it seems like he has already done a some of the stuff that I want to do.<br></li>
</ul>

</div>
</div>
</div>
<div id="outline-container-orga9bce2e" class="outline-2">
<h2 id="orga9bce2e"><a href="#orga9bce2e">Textbooks</a></h2>
<div class="outline-text-2" id="text-orga9bce2e">
<div class="index" id="orgaa795ee">
<ul class="org-ul">
<li>Seven Sketches in Compositionality (Brendan Fong, David I. Spivak): My attempt to get into category theory. This is supposedly a gentle introduction; still in the 1st chapter. Ain&rsquo;t got time for that right now.<br></li>

<li>Genetic Algorithms in Elixir (Sean Moriarity): Hands-on programming textbook on how to utilize Elixir, which I plan to use <a href="engineering.protoverse.project.html">for prototyping</a>.<br></li>
</ul>

</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">Published by <span class="author"><a href="/bio.html">Dan Dee</a></span></div>
<script defer src="/static/footer.js"></script>
</div>
</body>
</html>
